# Math Operators

In [11]:
3+5

8

In [2]:
3-2

1

In [3]:
3*5

15

In [4]:
3/5

0.6

In [5]:
"karan"+20

TypeError: can only concatenate str (not "int") to str

In [6]:
"karan"+"20"

'karan20'

In [9]:
"karan"*5

'karankarankarankarankaran'

# Comparison Operators

In [12]:
45>34

True

In [13]:
45<34

False

In [14]:
34*45>45*35

False

In [15]:
45==46-1

True

#Logical Operators

In [16]:
0 and 3

0

In [17]:
3 and 0

0

In [20]:
3 and 5

5

In [21]:
5 and 3

3

In [22]:
3 or 5

3

In [23]:
0 or 3

3

In [24]:
i=5
j=i
j=3
print(i)

5

# Data Types in Python: Int (4,5) Float (4.6, 5.7) bool (True, False) str ("Python")

# Variable name cannot start with any other character than _ nor with any integer

In [26]:
x="karan"

In [27]:
set(x)

{'a', 'k', 'n', 'r'}

In [39]:
i=5
j=3

if(i!=5):
    print("Bhai i toh 5 hai")
elif(j!=3):
    print("Ohh teri, j bhi 3 hai")
else:
    print("i 5 nahi hai")

i 5 nahi hai

In [33]:
x=3

if(x%2==0):
    print("Number is even")
else:
    print("Number is odd")

Number is odd

In [34]:
y=65

if (y>90):
    print("Grade A")
elif(60<y<90):
    print("Grade B")
else:
    print("Fail")

Grade B

# Looping constructs in Python

In [46]:
import pandas as pd

for i in range(10):
    print("Python is Awesome "+str(i+1))

Python is Awesome 1
Python is Awesome 2
Python is Awesome 3
Python is Awesome 4
Python is Awesome 5
Python is Awesome 6
Python is Awesome 7
Python is Awesome 8
Python is Awesome 9
Python is Awesome 10

In [7]:
for i in range(50):
    if i>10 and i%2 !=0:
        print(i)

11
13
15
17
19
21
23
25
27
29
31
33
35
37
39
41
43
45
47
49

In [8]:
for i in range(11,50):
    print(i)

11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49

In [9]:
for i in range(11,50,2):
    #2 in the 3rd  parameter sets the value by which the range function jumps in each sttep
    print(i)

11
13
15
17
19
21
23
25
27
29
31
33
35
37
39
41
43
45
47
49

### Functions

In [11]:
def aoc(r):
    area=22/7*r*r
    return area

aoc(3)

28.285714285714285

In [12]:
aoc(1)

3.142857142857143

In [17]:
def gat(x,y):
    #z=max(x,y)
    if x>y:
        z=x
    else:
        z=y
    return z

gat(30.434,5)

30.434

In [19]:
 list3=[1,'Python',2,'is',3,'awesome']

list3[1]

'Python'

In [20]:
list3.append('What')

In [21]:
print(list3)

[1, 'Python', 2, 'is', 3, 'awesome', 'What']

In [22]:
list3.extend([5,6,'Wow'])

In [23]:
print(list3)

[1, 'Python', 2, 'is', 3, 'awesome', 'What', 5, 6, 'Wow']

In [25]:
list3[3:6]

['is', 3, 'awesome']

In [26]:
list3.remove("Wow")

In [27]:
print(list3)

[1, 'Python', 2, 'is', 3, 'awesome', 'What', 5, 6]

In [28]:
del list3[3]

In [29]:
print(list3)

[1, 'Python', 2, 3, 'awesome', 'What', 5, 6]

In [30]:
for i in list3:
    print(i)

1
Python
2
3
awesome
What
5
6

In [32]:
dict1={'Ramesh':150,'Suresh':190}
dict1['Suresh']

190

In [33]:
marks={'A':56,'B':87,'C':76}
marks['B']

87

In [36]:
marks['D']=34

In [37]:
print(marks)

{'A': 56, 'B': 87, 'C': 76, 'D': 34}

In [39]:
marks.update({'A':67,'E':45})

In [41]:
print(marks)

{'A': 67, 'B': 87, 'C': 76, 'D': 34, 'E': 45}

In [42]:
marks

{'A': 67, 'B': 87, 'C': 76, 'D': 34, 'E': 45}

In [43]:
list3

[1, 'Python', 2, 3, 'awesome', 'What', 5, 6]

In [44]:
del marks['B']

In [45]:
marks

{'A': 67, 'C': 76, 'D': 34, 'E': 45}

In [46]:
import pandas as pd

In [47]:
firstcsv = pd.read_csv(r"C:\Users\karan\Downloads\Practice_Data_Py\Analytics Vidhya Course\read_csv\read_csv\data.csv")

In [48]:
firstcsv.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [54]:
firstexcel = pd.read_excel(r"C:\Users\karan\Downloads\Practice_Data_Py\Analytics Vidhya Course\read_csv\read_csv\data.xlsx")

In [55]:
firstexcel.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [69]:
import pandas as pd
print(firstcsv.shape[0])

891

In [60]:
firstcsv.size

10692

In [70]:
df=firstcsv

In [71]:
print(df)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

In [72]:
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [73]:
df.head(-5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q

In [74]:
df.head(+5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [75]:
df.shape

(891, 12)

In [77]:
df.tail(-5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [78]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [80]:
df[['Survived','Name']]

     Survived                                               Name
0           0                            Braund, Mr. Owen Harris
1           1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2           1                             Heikkinen, Miss. Laina
3           1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4           0                           Allen, Mr. William Henry
..        ...                                                ...
886         0                              Montvila, Rev. Juozas
887         1                       Graham, Miss. Margaret Edith
888         0           Johnston, Miss. Catherine Helen "Carrie"
889         1                              Behr, Mr. Karl Howell
890         0                                Dooley, Mr. Patrick

[891 rows x 2 columns]

In [81]:
df.iloc[:5]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [85]:
df.iloc[5:10,3:5]

                                                Name     Sex
5                                   Moran, Mr. James    male
6                            McCarthy, Mr. Timothy J    male
7                     Palsson, Master. Gosta Leonard    male
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female
9                Nasser, Mrs. Nicholas (Adele Achem)  female

In [86]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [90]:
df[df['Survived']==1]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [91]:
dd=pd.read_csv("bigmart_data.csv")

In [92]:
dd.head(5)

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
0,FDA15,9.30,Low Fat,0.016047,Dairy,249.8092,OUT049,1999,Medium,Tier 1,Supermarket Type1,3735.1380
1,DRC01,5.92,Regular,0.019278,Soft Drinks,48.2692,OUT018,2009,Medium,Tier 3,Supermarket Type2,443.4228
2,FDN15,17.50,Low Fat,0.016760,Meat,141.6180,OUT049,1999,Medium,Tier 1,Supermarket Type1,2097.2700
3,FDX07,19.20,Regular,0.000000,Fruits and Vegetables,182.0950,OUT010,1998,NaN,Tier 3,Grocery Store,732.3800
4,NCD19,8.93,Low Fat,0.000000,Household,53.8614,OUT013,1987,High,Tier 3,Supermarket Type1,994.7052

In [93]:
dd.sort_values(by='Outlet_Establishment_Year')

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
4338,FDH21,NaN,Low Fat,0.031074,Seafood,157.5604,OUT027,1985,Medium,Tier 3,Supermarket Type3,5704.5744
3689,FDD53,NaN,Low Fat,0.044008,Frozen Foods,43.7454,OUT027,1985,Medium,Tier 3,Supermarket Type3,671.1264
1139,FDH26,NaN,Regular,0.034532,Canned,142.2496,OUT027,1985,Medium,Tier 3,Supermarket Type3,2399.5432
1138,FDM21,NaN,Low Fat,0.064052,Snack Foods,256.1646,OUT027,1985,Medium,Tier 3,Supermarket Type3,7472.2734
3691,FDY36,NaN,Low Fat,0.016477,Baking Goods,74.3380,OUT019,1985,Small,Tier 1,Grocery Store,146.4760
...,...,...,...,...,...,...,...,...,...,...,...,...
3600,FDX31,20.35,Regular,0.014886,Fruits and Vegetables,234.4958,OUT018,2009,Medium,Tier 3,Supermarket Type2,3271.7412
5053,NCO53,16.20,Low Fat,0.175898,Health and Hygiene,183.7608,OUT018,2009,Medium,Tier 3,Supermarket Type2,2940.1728
7710,NCR18,15.85,Low Fat,0.020571,Household,41.6112,OUT018,2009,Medium,Tier 3,Supermarket Type2,255.6672
5750,FDV26,20.25,Regular,0.076471,Dairy,196.1794,OUT018,2009,Medium,Tier 3,Supermarket Type2,2731.1116
7378,FDJ26,15.30,Regular,0.085110,Canned,215.7218,OUT018,2009,Medium,Tier 3,Supermarket Type2,1923.4962

In [94]:
dd2=dd.sort_values(['Outlet_Establishment_Year','Item_Type'], ascending=False)[:5]

In [96]:
dd2[:5]

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
3185,FDC23,18.000,Low Fat,0.017979,Starchy Foods,178.3686,OUT018,2009,Medium,Tier 3,Supermarket Type2,3199.8348
3225,FDF11,10.195,reg,0.017703,Starchy Foods,239.4538,OUT018,2009,Medium,Tier 3,Supermarket Type2,3605.3070
3530,FDF59,12.500,LF,0.071534,Starchy Foods,124.9020,OUT018,2009,Medium,Tier 3,Supermarket Type2,1771.0280
3977,FDD11,12.850,LF,0.000000,Starchy Foods,253.0040,OUT018,2009,Medium,Tier 3,Supermarket Type2,3795.0600
4029,FDD23,9.500,Regular,0.048884,Starchy Foods,185.7898,OUT018,2009,Medium,Tier 3,Supermarket Type2,2619.2572

In [97]:
def clip_price(x):
    if x>200:
        x=200
    return x
dd['Item_MRP'][:5]

0    249.8092
1     48.2692
2    141.6180
3    182.0950
4     53.8614
Name: Item_MRP, dtype: float64

In [98]:
dd['Item_MRP'].apply(lambda x: clip_price(x))[:5]

0    200.0000
1     48.2692
2    141.6180
3    182.0950
4     53.8614
Name: Item_MRP, dtype: float64

In [105]:
def label_encode(city):
    if city=='Tier 1':
        label=0
    elif city=='Tier 2':
        label=1
    else:
        label=2
    return label

dd['Outlet_Location_Type'] = dd['Outlet_Location_Type'].apply(lambda x: label_encode(x))

In [106]:
dd['Outlet_Location_Type']

0       2
1       2
2       2
3       2
4       2
       ..
8518    2
8519    2
8520    2
8521    2
8522    2
Name: Outlet_Location_Type, Length: 8523, dtype: int64

In [107]:
dd['Outlet_Location_Type'].value_counts()

2    8523
Name: Outlet_Location_Type, dtype: int64

In [108]:
dd2['Outlet_Location_Type'].value_counts()

Tier 3    5
Name: Outlet_Location_Type, dtype: int64